In [1]:
import warnings
warnings.filterwarnings("ignore")

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
calls = pd.read_csv('datasets/megaline_calls.csv')

In [4]:
messages = pd.read_csv('datasets/megaline_messages.csv')

In [5]:
internet = pd.read_csv('datasets/megaline_internet.csv')

In [6]:
users = pd.read_csv('datasets/megaline_users1.csv')

In [7]:
plans = pd.read_csv('datasets/megaline_plans.csv')

In [8]:
calls.head()

         id  user_id   call_date  duration
0   1000_93     1000  2018-12-27      8.52
1  1000_145     1000  2018-12-27     13.66
2  1000_247     1000  2018-12-27     14.48
3  1000_309     1000  2018-12-28      5.76
4  1000_380     1000  2018-12-30      4.22

In [9]:
calls.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 137735 entries, 0 to 137734
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   id         137735 non-null  object
 1   user_id    137735 non-null  int64
 2   call_date  137735 non-null  object
 3   duration   137735 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 4.2+ MB

In [10]:
messages.head()

         id  user_id message_date
0  1000_125     1000   2018-12-27
1  1000_160     1000   2018-12-31
2  1000_223     1000   2018-12-31
3  1000_251     1000   2018-12-27
4  1000_255     1000   2018-12-26

In [11]:
messages.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76051 entries, 0 to 76050
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            76051 non-null  object
 1   user_id       76051 non-null  int64
 2   message_date  76051 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.7+ MB

In [12]:
internet.head()

         id  user_id session_date  mb_used
0   1000_13     1000   2018-12-29    89.86
1  1000_204     1000   2018-12-31     0.00
2  1000_379     1000   2018-12-28   660.40
3  1000_413     1000   2018-12-26   270.99
4  1000_442     1000   2018-12-27   880.22

In [13]:
internet.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 104825 entries, 0 to 104824
Data columns (total 4 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   id            104825 non-null  object
 1   user_id       104825 non-null  int64
 2   session_date  104825 non-null  object
 3   mb_used       104825 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 3.2+ MB

In [15]:
users.head()

,user_id,first_name,last_name,age,city,reg_date,plan,churn_date
0,1000,Anamaria,Bauer,45,"Atlanta-Sandy Springs-Roswell, GA MSA",2018-12-24,ultimate,NaN
1,1001,Mickey,Wilkerson,28,"Seattle-Tacoma-Bellevue, WA MSA",2018-08-13,surf,NaN
2,1002,Carlee,Hoffman,36,"Las Vegas-Henderson-Paradise, NV MSA",2018-10-21,surf,NaN
3,1003,Reynaldo,Jenkins,52,"Tulsa, OK MSA",2018-01-28,surf,NaN
4,1004,Leonila,Thompson,40,"Seattle-Tacoma-Bellevue, WA MSA",2018-05-23,surf,NaN

In [16]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     500 non-null    int64
 1   first_name  500 non-null    object
 2   last_name   500 non-null    object
 3   age         500 non-null    int64
 4   city        500 non-null    object
 5   reg_date    500 non-null    object
 6   plan        500 non-null    object
 7   churn_date  34 non-null     object
dtypes: int64(2), object(6)
memory usage: 31.4+ KB

In [17]:
plans.head()

,messages_included,mb_per_month_included,minutes_included,usd_monthly_pay,usd_per_gb,usd_per_message,usd_per_minute,plan_name
0,50,15360,500,20,10,0.03,0.03,surf
1,1000,30720,3000,70,7,0.01,0.01,ultimate

### Create a report

In [20]:
users['reg_month'] = users['reg_date'].values.astype('datetime64[M]')
#create a reg_month column

In [21]:
min_month = users['reg_date'].values.astype('datetime64[M]').min()
#minimum month

In [22]:
max_month = users['reg_date'].values.astype('datetime64[M]').max()
#maximum month

In [23]:
(min_month, max_month)
#range of minimum and maximum

(numpy.datetime64('2018-01'), numpy.datetime64('2018-12'))

In [24]:
months = pd.DataFrame(pd.date_range(min_month, max_month, freq='MS'))
#create a dataframe of the months

In [25]:
months

            0
0  2018-01-01
1  2018-02-01
2  2018-03-01
3  2018-04-01
4  2018-05-01
5  2018-06-01
6  2018-07-01
7  2018-08-01
8  2018-09-01
9  2018-10-01
10 2018-11-01
11 2018-12-01

In [26]:
months.columns = ['month'] #rename the month column

In [27]:
len(users)*len(months) #check length of merging each user with each month

6000

In [28]:
users['key'] = 1
months['key'] = 1
#create a uniform key to merge the 2df on

In [29]:
report = months.merge(users, on='key')
#the merge

In [30]:
report.head()

,month,key,user_id,first_name,last_name,age,city,reg_date,plan,churn_date,reg_month
0,2018-01-01,1,1000,Anamaria,Bauer,45,"Atlanta-Sandy Springs-Roswell, GA MSA",2018-12-24,ultimate,NaN,2018-12-01
1,2018-01-01,1,1001,Mickey,Wilkerson,28,"Seattle-Tacoma-Bellevue, WA MSA",2018-08-13,surf,NaN,2018-08-01
2,2018-01-01,1,1002,Carlee,Hoffman,36,"Las Vegas-Henderson-Paradise, NV MSA",2018-10-21,surf,NaN,2018-10-01
3,2018-01-01,1,1003,Reynaldo,Jenkins,52,"Tulsa, OK MSA",2018-01-28,surf,NaN,2018-01-01
4,2018-01-01,1,1004,Leonila,Thompson,40,"Seattle-Tacoma-Bellevue, WA MSA",2018-05-23,surf,NaN,2018-05-01

In [31]:
report.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6000 entries, 0 to 5999
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   month       6000 non-null   datetime64[ns]
 1   key         6000 non-null   int64
 2   user_id     6000 non-null   int64
 3   first_name  6000 non-null   object
 4   last_name   6000 non-null   object
 5   age         6000 non-null   int64
 6   city        6000 non-null   object
 7   reg_date    6000 non-null   object
 8   plan        6000 non-null   object
 9   churn_date  408 non-null    object
 10  reg_month   6000 non-null   datetime64[ns]
dtypes: datetime64[ns](2), int64(3), object(6)
memory usage: 562.5+ KB

In [32]:
len(report[report['month']>=report['reg_month']]) #some users came after the minimal date

3355

In [33]:
report = report[report['month']>=report['reg_month']] # select month for user after registration

In [34]:
report = report[['month', 'key', 'user_id', 'city', 'plan', 'reg_month']] #select only wanted columns

In [35]:
#specific user
report[report['user_id'] == 1000]

,month,key,user_id,city,plan,reg_month
5500,2018-12-01,1,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,2018-12-01

In [41]:
report[report['user_id'] == 1003]

          month  key  user_id           city  plan  reg_month
3    2018-01-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
503  2018-02-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
1003 2018-03-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
1503 2018-04-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
2003 2018-05-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
2503 2018-06-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
3003 2018-07-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
3503 2018-08-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
4003 2018-09-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
4503 2018-10-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
5003 2018-11-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
5503 2018-12-01    1     1003  Tulsa, OK MSA  surf 2018-01-01

### Calls

In [42]:
data = users[['user_id', 'city', 'plan']]
#take specific columns from users

In [43]:
data_calls = data.merge(calls, how='outer', on='user_id')
#merge on data with calls by the outer

In [44]:
data_calls.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 137754 entries, 0 to 137753
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   user_id    137754 non-null  int64
 1   city       137754 non-null  object
 2   plan       137754 non-null  object
 3   id         137735 non-null  object
 4   call_date  137735 non-null  object
 5   duration   137735 non-null  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 7.4+ MB

In [45]:
data_calls.head()

,user_id,city,plan,id,call_date,duration
0,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_93,2018-12-27,8.52
1,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_145,2018-12-27,13.66
2,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_247,2018-12-27,14.48
3,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_309,2018-12-28,5.76
4,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_380,2018-12-30,4.22

In [48]:
data_calls['call_date'] = pd.to_datetime(data_calls['call_date'], format='%Y-%m-%d')

In [49]:
data_calls['month'] = data_calls['call_date'].values.astype('datetime64[M]')
#create a month column of datetime

In [50]:
calls_month = data_calls.groupby(['user_id', 'month'])[['duration']].agg(['sum']).reset_index()
#create a groupby which has the sum of call duration for each user in each month

In [51]:
calls_month.sample(10)

     user_id      month duration
                             sum
1418    1316 2018-07-01   280.55
2035    1445 2018-09-01   247.97
1500    1333 2018-11-01    60.80
855     1182 2018-11-01   217.90
509     1110 2018-05-01    65.07
2103    1465 2018-10-01   631.52
2211    1491 2018-06-01   373.47
1853    1404 2018-10-01   628.06
709     1153 2018-12-01   594.79
1178    1256 2018-09-01   312.97

In [52]:
calls_month.columns = ['user_id', 'month', 'total_duration'] # maybe round up the duration at this point

In [53]:
#round up the minutes to the nearest whole number
calls_month['total_duration'] = calls_month['total_duration'].round(0)

In [54]:
user_plan = users[['user_id', 'plan']]
#select each user and there plan to be the dictionary values for merging

In [55]:
user_plan[user_plan['user_id'] == 1233] #testing

     user_id  plan
233     1233  surf

In [56]:
calls_month = calls_month.merge(user_plan, on='user_id', how='left')
#merge to find each users plan, in each month.

In [57]:
plans
#look at plans

,messages_included,mb_per_month_included,minutes_included,usd_monthly_pay,usd_per_gb,usd_per_message,usd_per_minute,plan_name
0,50,15360,500,20,10,0.03,0.03,surf
1,1000,30720,3000,70,7,0.01,0.01,ultimate

In [58]:
call_plan = plans[['plan_name', 'minutes_included']]
#a df for minutes included in each plan

In [59]:
call_plan.columns = ['plan', 'plan_minutes']
#change the column names

In [60]:
call_plan
#check

       plan  plan_minutes
0      surf           500
1  ultimate          3000

In [61]:
calls_month = calls_month.merge(call_plan, on='plan', how='left')
#merge each user with their minutes included for their plan, in each month

In [62]:
calls_month['extra_mins'] = calls_month['total_duration'] - calls_month['plan_minutes']
#calculate the extra minutes used every month according tomplan package

In [63]:
#calls_month['extra_mins'] = calls_month['extra_mins'].round(0) #round up the minutes

In [64]:
#change mins to integer
#calls_month['extra_mins'] = calls_month['extra_mins'].astype(np.int64)

In [114]:
#a function to change the -ve values to zero
def count_calc(extra):
    if extra < 0:
        return 0
    if extra == 0:
        return 0
    if extra > 0:
        return extra

In [66]:
calls_month['extra_duration'] = calls_month['extra_mins'].apply(count_calc)
#apply the function to the column

In [67]:
extraminute_plan = plans[['plan_name', 'usd_per_minute']]
# a df to use as key for extra mins in each plan

In [68]:
extraminute_plan.columns = ['plan', 'usd_per_minute']
#change the columns

In [69]:
calls_month = calls_month.merge(extraminute_plan, on='plan', how='left')
#merge each extra minute cost to the calls

In [70]:
calls_month['call_cost'] = calls_month['extra_duration'] * calls_month['usd_per_minute']
#create a cost column of extra mintes used

In [71]:
calls_month = calls_month[['user_id', 'month', 'call_cost']]
#select required columns

In [72]:
report = report.merge(calls_month, on=['user_id', 'month'], how='left')
#merge with the report

In [73]:
report.shape

(3355, 7)

In [74]:
calls_month.shape

(2258, 3)

In [75]:
report.head()
#NaN are for users who did not make calls that month
#0.0 are for users who had no extra cost

,month,key,user_id,city,plan,reg_month,call_cost
0,2018-01-01,1,1003,"Tulsa, OK MSA",surf,2018-01-01,NaN
1,2018-01-01,1,1011,"Cleveland-Elyria, OH MSA",ultimate,2018-01-01,NaN
2,2018-01-01,1,1019,"Jacksonville, FL MSA",surf,2018-01-01,NaN
3,2018-01-01,1,1029,"Tampa-St. Petersburg-Clearwater, FL MSA",surf,2018-01-01,NaN
4,2018-01-01,1,1042,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD MSA",surf,2018-01-01,0.0

### Messages

In [76]:
data.head()

   user_id                                   city      plan
0     1000  Atlanta-Sandy Springs-Roswell, GA MSA  ultimate
1     1001        Seattle-Tacoma-Bellevue, WA MSA      surf
2     1002   Las Vegas-Henderson-Paradise, NV MSA      surf
3     1003                          Tulsa, OK MSA      surf
4     1004        Seattle-Tacoma-Bellevue, WA MSA      surf

In [77]:
messages.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76051 entries, 0 to 76050
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            76051 non-null  object
 1   user_id       76051 non-null  int64
 2   message_date  76051 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.7+ MB

In [78]:
data_messages = data.merge(messages, on='user_id', how='right')

In [84]:
data_messages['message_date'] = pd.to_datetime(data_messages['message_date'], format='%Y-%m-%d')

In [96]:
data_messages['id'].duplicated().sum()
#all messages are unique, so they each get a count of 1.

0

In [82]:
data_messages['msg_count'] = 1

In [95]:
data_messages.head()

,user_id,city,plan,id,message_date,msg_count,month
0,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_125,2018-12-27,1,2018-12-01
1,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_160,2018-12-31,1,2018-12-01
2,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_223,2018-12-31,1,2018-12-01
3,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_251,2018-12-27,1,2018-12-01
4,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_255,2018-12-26,1,2018-12-01

In [90]:
data_messages['month'] = data_messages['message_date'].values.astype('datetime64[M]')

In [92]:
msg_month = data_messages.groupby(['user_id', 'month'])[['msg_count']].agg(['sum']).reset_index()

In [125]:
msg_month.sample(10)

      user_id      month  msg_cost
1051     1276 2018-12-01      0.00
300      1084 2018-11-01      1.29
399      1113 2018-10-01      0.00
562      1148 2018-12-01      0.78
283      1081 2018-09-01      0.00
335      1095 2018-11-01      0.00
724      1194 2018-12-01      0.18
868      1235 2018-11-01      0.00
1741     1475 2018-09-01      0.00
374      1104 2018-12-01      0.00

In [98]:
msg_month.columns = ['user_id', 'month', 'total_msg']

In [101]:
msg_month = msg_month.merge(user_plan, on='user_id', how='left')

In [103]:
msg_plan = plans[['plan_name', 'messages_included']]
msg_plan.columns = ['plan', 'plan_messages']

In [104]:
msg_plan

       plan  plan_messages
0      surf             50
1  ultimate           1000

In [106]:
msg_month = msg_month.merge(msg_plan, on='plan', how='left')

In [108]:
msg_month['xtra_msg'] = msg_month['total_msg'] - msg_month['plan_messages']

In [115]:
msg_month['xtra_txt'] = msg_month['xtra_msg'].apply(count_calc)

In [117]:
extramsg_plan = plans[['plan_name', 'usd_per_message']]

In [118]:
extramsg_plan.columns = ['plan', 'usd_per_message']

In [119]:
msg_month = msg_month.merge(extramsg_plan, on='plan', how='left')

In [121]:
msg_month['msg_cost'] = msg_month['xtra_txt'] * msg_month['usd_per_message']

In [123]:
msg_month = msg_month[['user_id', 'month', 'msg_cost']]

In [134]:
report.head()

,month,key,user_id,city,plan,reg_month,call_cost_x,call_cost_y,msg_cost
0,2018-01-01,1,1003,"Tulsa, OK MSA",surf,2018-01-01,NaN,NaN,NaN
1,2018-01-01,1,1011,"Cleveland-Elyria, OH MSA",ultimate,2018-01-01,NaN,NaN,NaN
2,2018-01-01,1,1019,"Jacksonville, FL MSA",surf,2018-01-01,NaN,NaN,NaN
3,2018-01-01,1,1029,"Tampa-St. Petersburg-Clearwater, FL MSA",surf,2018-01-01,NaN,NaN,NaN
4,2018-01-01,1,1042,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD MSA",surf,2018-01-01,0.0,0.0,NaN

In [133]:
report.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3355 entries, 0 to 3354
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   month        3355 non-null   datetime64[ns]
 1   key          3355 non-null   int64
 2   user_id      3355 non-null   int64
 3   city         3355 non-null   object
 4   plan         3355 non-null   object
 5   reg_month    3355 non-null   datetime64[ns]
 6   call_cost_x  2257 non-null   float64
 7   call_cost_y  2257 non-null   float64
 8   msg_cost     1806 non-null   float64
dtypes: datetime64[ns](2), float64(3), int64(2), object(2)
memory usage: 262.1+ KB

In [132]:
report = report.merge(msg_month, on=['user_id', 'month'], how='left')

In [135]:
report.shape[0]

3355

### Internet

### Profit